## Q1. List any five functions of the pandas library with execution.

In [1]:
import pandas as pd

In [6]:
df = pd.read_csv('taxonomy.csv.xls')

In [7]:
df

    taxonomy_id                          name parent_id           parent_name
0           101                     Emergency       NaN                   NaN
1        101-01             Disaster Response       101             Emergency
2        101-02                Emergency Cash       101             Emergency
3     101-02-01             Help Pay for Food    101-02        Emergency Cash
4     101-02-02       Help Pay for Healthcare    101-02        Emergency Cash
..          ...                           ...       ...                   ...
285   111-01-07              Workplace Rights    111-01  Advocacy & Legal Aid
286      111-02                     Mediation       111                 Legal
287      111-03                        Notary       111                 Legal
288      111-04                Representation       111                 Legal
289      111-05  Translation & Interpretation       111                 Legal

[290 rows x 4 columns]

In [8]:
df.head()

  taxonomy_id                     name parent_id     parent_name
0         101                Emergency       NaN             NaN
1      101-01        Disaster Response       101       Emergency
2      101-02           Emergency Cash       101       Emergency
3   101-02-01        Help Pay for Food    101-02  Emergency Cash
4   101-02-02  Help Pay for Healthcare    101-02  Emergency Cash

In [9]:
df.tail()

    taxonomy_id                          name parent_id           parent_name
285   111-01-07              Workplace Rights    111-01  Advocacy & Legal Aid
286      111-02                     Mediation       111                 Legal
287      111-03                        Notary       111                 Legal
288      111-04                Representation       111                 Legal
289      111-05  Translation & Interpretation       111                 Legal

In [10]:
df.columns

Index(['taxonomy_id', 'name', 'parent_id', 'parent_name'], dtype='object')

In [11]:
df.dtypes

taxonomy_id    object
name           object
parent_id      object
parent_name    object
dtype: object

In [21]:
df.loc[3]

taxonomy_id            101-02-01
name           Help Pay for Food
parent_id                 101-02
parent_name       Emergency Cash
Name: 3, dtype: object

## Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [22]:
data = {'a':[1,2,3],'b':[4,5,6],'c':[7,8,9]}
df1 = pd.DataFrame(data)

In [23]:
df1

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [36]:
df1.reindex([1,3,5])

     a    b    c
1  2.0  5.0  8.0
3  NaN  NaN  NaN
5  NaN  NaN  NaN

## Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.
### For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

In [37]:
df = pd.DataFrame({'values':[10,20,30,40,50]})

In [38]:
df

   values
0      10
1      20
2      30
3      40
4      50

In [42]:
df[0:3].sum()

values    60
dtype: int64

## Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [43]:
df = pd.DataFrame({'Text':['kunal','patil','pw','pwskills','sudh']})

In [44]:
df

       Text
0     kunal
1     patil
2        pw
3  pwskills
4      sudh

In [45]:
df['Word_count'] = df['Text'].apply(lambda x : len(x))

In [46]:
df

       Text  Word_count
0     kunal           5
1     patil           5
2        pw           2
3  pwskills           8
4      sudh           4

## Q5. How are DataFrame.size() and DataFrame.shape() different?

In [48]:
df.size

10

In [50]:
## Size function gives total number of elements present in dataframe

In [51]:
df.shape

(5, 2)

In [52]:
## Shape function gives number of rows and columns

## Q6. Which function of pandas do we use to read an excel file?

In [53]:
## pd.read_excel("File_name")  this function is used to read exel file in pandas

## Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

In [54]:
df = pd.DataFrame({'Email':['kunal@gmail.com','patil@gmail.com','krish123@gmail.com','sudh55@gmail.com']})

In [55]:
df

                Email
0     kunal@gmail.com
1     patil@gmail.com
2  krish123@gmail.com
3    sudh55@gmail.com

In [87]:
def users(x):
    for i in range(len(x)):
        if x[i]!='@':
            a=[]
            a.append(x[i])
            return a
        else:
            break
        
        
df['Username'] = df['Email'].apply(users)

In [88]:
df

                Email Username
0     kunal@gmail.com      [k]
1     patil@gmail.com      [p]
2  krish123@gmail.com      [k]
3    sudh55@gmail.com      [s]

## Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.

In [89]:
df = pd.DataFrame({'A':[3,8,6,2,9],'B':[5,2,9,3,1],'C':[1,7,4,5,2]})

In [90]:
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [97]:
df[(df['A'].apply(lambda x:x>5)) & (df['B'].apply(lambda x:x<10))]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

## Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [98]:
df = pd.DataFrame({'Values':[1,2,3,4,5]})

In [99]:
df

   Values
0       1
1       2
2       3
3       4
4       5

In [100]:
df.mean()

Values    3.0
dtype: float64

In [101]:
df.median()

Values    3.0
dtype: float64

In [102]:
df.std()

Values    1.581139
dtype: float64

## Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

## Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.

In [114]:
df = pd.DataFrame({'Date':['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05']})

In [122]:
df['Date'] = pd.to_datetime(df['Date'])

In [123]:
df

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [124]:
df.dtypes

Date    datetime64[ns]
dtype: object

In [129]:
df['WeekDay'] = df['Date'].dt.day_name()

In [130]:
df

        Date    WeekDay
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

## Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [133]:
df = pd.DataFrame({'Date':['2023-01-01','2023-01-02','2023-02-03','2023-01-04','2023-02-05']})

In [134]:
df['Date'] = pd.to_datetime(df['Date'])

In [148]:
df

Date    datetime64[ns]
dtype: object

## Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

In [131]:
## we have to import pandas library.